{
  "Data": [
    {
      "TYPE": "121",
      "ID": 53779943,
      "GUID": "https://cryptonews.com/?p=445064",
      "PUBLISHED_ON": 1761740672,
      "PUBLISHED_ON_NS": null,
      "IMAGE_URL": "https://resources.cryptocompare.com/news/52/53779943.jpeg",
      "TITLE": "Why Is Crypto Down Today? – October 29, 2025",
      "SUBTITLE": null,
      "AUTHORS": "Amin Ayan",
      "URL": "https://cryptonews.com/news/why-is-crypto-down-today-october-29-2025/",
      "SOURCE_ID": 52,
      "BODY": "The global cryptocurrency market is down today, with total market capitalization falling 1.6% to $3.89 trillion, according to data from CoinMarketCap. Meanwhile, 24-hour trading volume stands at $171 billion, showing a modest uptick despite broad declines across major assets. Key Takeaways: The global crypto market cap fell 1.6% to $3.89 trillion; Bitcoin dropped 2% to $112,859, as Ethereum declined 3% to $3,991; The Crypto Fear and Greed Index fell back to 39 (Fear); Bitwise’s Solana ETF drew $69.5 million in debut inflows; The Fed is expected to cut rates by 25 basis points today; US spot Bitcoin ETFs logged $202.48M inflows; Ethereum ETFs saw even stronger inflows at $246.02M; Trump Media’s Truth Social partnered with Crypto.com to launch prediction markets; Crypto Winners & Losers At the time of writing, Bitcoin (BTC) is down 1.5% over the past 24 hours, trading at $112,859. Ethereum (ETH) has slipped 3.0% to $3,991. BNB fell 2.1% to $1,111, and Dogecoin (DOGE) dropped 3.1% to $0.1939, marking one of the steepest losses among the top 10. XRP (XRP) was the only major asset in the green, rising 0.5% to $2.64. Solana (SOL) edged down 1.9% to $196.34. Among the top 100 tokens, only a handful are up. Diverge Loop (DIVER) leads today’s gainers, soaring 88.5%, while Vutlsig (VUT) dropped 31.9%, making it one of the biggest decliners in the market. Enso , Arcblock , and ChainOpera AI are the most trending coins over the past day, leading conversations across the market. Meanwhile, Bitwise Asset Management’s newly launched spot Solana ETF is seeing strong investor appetite, recording $69.5 million in inflows on its first trading day. The figure is nearly six times the $12 million debut haul of its closest competitor, the Rex-Osprey Solana Staking ETF (SSK), according to data from Farside. 6/ The other obvious source of capital flow into SOL is the ETH ETFs There is roughly ~$25B in ETH ETFs today. I think it's fair to assume that the substantial majority of that capital was legally unable to own SOL… until today — Kyle Samani (@KyleSamani) October 28, 2025 Fed Rate Cut Looms: Crypto on Edge as Markets Await Liquidity Signals The Federal Reserve is widely expected to announce a 25-basis-point rate cut today, lowering its benchmark range to 3.75%–4% as markets brace for signals on future liquidity moves. Traders are also watching for hints that the Fed could slow or halt balance-sheet runoff, a shift that would inject liquidity into financial markets. The dollar has softened amid growing expectations of a broader easing cycle. Bitget CEO Gracy Chen said markets are “on a knife-edge between hope and hesitation,” noting that a dovish Fed could lift risk assets like crypto, while a hawkish tone could trigger a quick pullback. The decision and press conference by Fed Chair Jerome Powell at 2 p.m. ET will be closely parsed for clues on policy direction. BREAKING: 98% chance of a 25 bps Fed rate cut tomorrow 2% chance of a 50 bps cut. pic.twitter.com/XEkIXFDBEa — Kalshi (@Kalshi) October 28, 2025 According to Bitget chief analyst Ryan Lee, a rate cut could drive 5%–10% short-term rallies in Bitcoin and Ethereum as lower borrowing costs boost risk appetite. He added that capital could rotate into altcoins such as Solana (SOL) and XRP, further enhancing crypto’s appeal as a growth and inflation hedge. Beyond the Fed, this week’s macro backdrop includes the Bank of Japan’s policy meeting and earnings from big tech giants, including Microsoft, Apple, Alphabet, Amazon, and Meta. Levels & Events to Watch Next At the time of writing, Bitcoin is trading at $112,760, showing a mild 0.15% decline over the past 24 hours. BTC traded sideways through most of the session, reaching an intraday high near $113,800 before dipping to a low around $111,900. A decisive breakout above $115,000 could pave the way for a move toward $118,200 and $121,000, signaling renewed bullish momentum. However, failure to hold above $112,000 may open the door for a retest of the $110,500 support zone, where buying interest previously emerged. Meanwhile, Ethereum is trading at $3,986, up 0.16% in the past 24 hours. ETH touched a session high of around $4,050 before briefly pulling back to $3,920. If ETH breaks above $4,100, it could challenge the $4,250 and $4,400 resistance levels. On the downside, a drop below $3,900 could push the price toward $3,750, with further weakness potentially testing the $3,600 zone. Meanwhile, the crypto market sentiment has slipped back into the fear zone, with the Crypto Fear and Greed Index standing at 39 , down from 42 (neutral) yesterday. Compared to last week’s reading of 29 (fear), sentiment has improved modestly but remains subdued. The index continues to show hesitation, highlighting a market still recovering from recent volatility and lacking clear bullish momentum. Spot Bitcoin exchange-traded funds (ETFs) saw $202.48 million in net inflows on October 28, marking another strong day for institutional demand. The cumulative total net inflow now stands at $62.34 billion, with a total value traded of $4.18 billion and $154.81 billion in total net assets, representing 6.88% of Bitcoin’s market cap, according to data from SoSoValue. Out of the 12 ETFs, three recorded positive inflows. Ark & 21Shares (ARKB) led with $75.84 million, followed by Fidelity’s FBTC at $67.05 million, and BlackRock’s IBIT with $59.60 million. Likewise, spot Ethereum ETFs saw a strong rebound in demand on October 28, recording $246.02 million in net inflows, ending their brief slowdown. The cumulative total net inflow has now risen to $14.73 billion, according to data from SoSoValue. Out of the nine listed ETFs, four posted positive inflows, while only one recorded minor outflows. Fidelity’s FETH led the day with $99.27 million, followed by BlackRock’s ETHA with $76.37 million and Grayscale’s ETH with $73.03 million. Meanwhile, Trump Media and Technology Group, the parent company of Truth Social, has announced a new partnership with Crypto.com that will bring prediction markets to the social media platform, positioning it as the first publicly traded social media company to integrate such technology. The collaboration, made through Crypto.com’s US affiliate, Crypto.com | Derivatives North America (CDNA), will allow Truth Social users to trade on the outcomes of real-world events ranging from elections and economic data to sports and commodities. Truth Social will become the world’s first social media platform offering prediction markets via exclusive partnership with https://t.co/vCNztATkNg . Read more https://t.co/RoZqNeKenl pic.twitter.com/uj2PgYeTgU — Crypto.com (@cryptocom) October 28, 2025 The post Why Is Crypto Down Today? – October 29, 2025 appeared first on Cryptonews .",
      "KEYWORDS": "Altcoin News|Bitcoin|Cryptocurrency|Ethereum",
      "LANG": "EN",
      "UPVOTES": 0,
      "DOWNVOTES": 0,
      "SCORE": 0,
      "SENTIMENT": "NEUTRAL",
      "STATUS": "ACTIVE",
      "CREATED_ON": 1761740701,
      "UPDATED_ON": 1761740701,
      "SOURCE_DATA": {
        "TYPE": "120",
        "ID": 52,
        "SOURCE_KEY": "cryptonews",
        "NAME": "cryptonews",
        "IMAGE_URL": "https://images.cryptocompare.com/news/default/cryptonews.png",
        "URL": "https://cryptonews.com/news/feed/",
        "LANG": "EN",
        "SOURCE_TYPE": "RSS",
        "LAUNCH_DATE": null,
        "SORT_ORDER": 0,
        "BENCHMARK_SCORE": 0,
        "STATUS": "ACTIVE",
        "LAST_UPDATED_TS": 1761738278,
        "CREATED_ON": 1657730129,
        "UPDATED_ON": 1680604053
      },
      "CATEGORY_DATA": [
        {
          "TYPE": "122",
          "ID": 14,
          "NAME": "BTC",
          "CATEGORY": "BTC"
        },
        {
          "TYPE": "122",
          "ID": 24,
          "NAME": "ETH",
          "CATEGORY": "ETH"
        },
        {
          "TYPE": "122",
          "ID": 37,
          "NAME": "MARKET",
          "CATEGORY": "MARKET"
        },
        {
          "TYPE": "122",
          "ID": 210,
          "NAME": "MACROECONOMICS",
          "CATEGORY": "MACROECONOMICS"
        },
        {
          "TYPE": "122",
          "ID": 211,
          "NAME": "CRYPTOCURRENCY",
          "CATEGORY": "CRYPTOCURRENCY"
        }
      ]
    },
    {
      "TYPE": "121",
      "ID": 53779929,
      "GUID": "https://en.bitcoinsistemi.com/legendary-bitcoin-whale-james-wynn-announces-his-new-target-altcoin-ill-make-a-big-investment/",
      "PUBLISHED_ON": 1761740647,
      "PUBLISHED_ON_NS": null,
      "IMAGE_URL": "https://resources.cryptocompare.com/news/81/53779929.jpeg",
      "TITLE": "Legendary Bitcoin Whale James Wynn Announces His New Target Altcoin! \"I'll Make a Big Investment!\"",
      "SUBTITLE": null,
      "AUTHORS": "Elif Azra Güven",
      "URL": "https://en.bitcoinsistemi.com/legendary-bitcoin-whale-james-wynn-announces-his-new-target-altcoin-ill-make-a-big-investment/",
      "SOURCE_ID": 81,
      "BODY": "James Wynn, one of the most talked-about traders of his time and known for his high leverage transactions in Bitcoin and Ethereum, announced his new target. Accordingly, the famous giant whale James Wynn joined the XRP community. James Wynn, in his post from his X account, announced his decision to invest a significant portion of his portfolio in XRP. Wynn, who claimed to have achieved great success by earning over $100 million in just 70 days trading futures, also became known for losing a similar fortune of millions of dollars in leveraged trading in mid-2025. Wynn, who is famous for both profit and loss, said he spent 24 hours researching XRP and decided to invest $25 million or more as a result. Stating that he believes XRP can revolutionize banking systems, the giant whale argued that investing in XRP is a gamble, as is the case with all investments. Finally, Wynn called on the XRP community (both critics and advocates) to educate himself about XRP. At this point, XRP supporter lawyer Bill Morgan reminded Wynn that XRP has never fallen outside the top 10 cryptocurrencies by market capitalization in its 13-year history, a testament to XRP's resilience. *This is not investment advice. Continue Reading: Legendary Bitcoin Whale James Wynn Announces His New Target Altcoin! \"I'll Make a Big Investment!\"",
      "KEYWORDS": "Altcoin|Analysis|News|XRP",
      "LANG": "EN",
      "UPVOTES": 0,
      "DOWNVOTES": 0,
      "SCORE": 0,
      "SENTIMENT": "POSITIVE",
      "STATUS": "ACTIVE",
      "CREATED_ON": 1761740681,
      "UPDATED_ON": 1761740681,
      "SOURCE_DATA": {
        "TYPE": "120",
        "ID": 81,
        "SOURCE_KEY": "bitcoinsistemi",
        "NAME": "BitcoinSistemi",
        "IMAGE_URL": "https://resources.cryptocompare.com/news/81/default.png",
        "URL": "https://en.bitcoinsistemi.com/feed/",
        "LANG": "EN",
        "SOURCE_TYPE": "RSS",
        "LAUNCH_DATE": null,
        "SORT_ORDER": 0,
        "BENCHMARK_SCORE": 0,
        "STATUS": "ACTIVE",
        "LAST_UPDATED_TS": 1761738175,
        "CREATED_ON": 1692873798,
        "UPDATED_ON": 1692873836
      },
      "CATEGORY_DATA": [
        {
          "TYPE": "122",
          "ID": 5,
          "NAME": "ALTCOIN",
          "CATEGORY": "ALTCOIN"
        },
        {
          "TYPE": "122",
          "ID": 14,
          "NAME": "BTC",
          "CATEGORY": "BTC"
        },
        {
          "TYPE": "122",
          "ID": 37,
          "NAME": "MARKET",
          "CATEGORY": "MARKET"
        },
        {
          "TYPE": "122",
          "ID": 58,
          "NAME": "XRP",
          "CATEGORY": "XRP"
        },
        {
          "TYPE": "122",
          "ID": 211,
          "NAME": "CRYPTOCURRENCY",
          "CATEGORY": "CRYPTOCURRENCY"
        }
      ]
    },
    {
      "TYPE": "121",
      "ID": 53779942,
      "GUID": "https://cryptonews.com/?p=445088",
      "PUBLISHED_ON": 1761740644,
      "PUBLISHED_ON_NS": null,
      "IMAGE_URL": "https://resources.cryptocompare.com/news/52/53779942.jpeg",
      "TITLE": "Solana Price Prediction: SOL is All The Rage Today As ETFs Launch and Western Union Announces Stablecoin Launch for Early 2026 – Is a New ATH Coming?",
      "SUBTITLE": null,
      "AUTHORS": "Alejandro Arrieche",
      "URL": "https://cryptonews.com/news/solana-price-prediction-sol-is-all-the-rage-today-as-etfs-launch-and-western-union-announces-stablecoin-launch-for-early-2026-is-a-new-ath-coming/",
      "SOURCE_ID": 52,
      "BODY": "The new exchange-traded fund (ETF) launched by Bitwise for SOL and an interesting announcement from Western Union this week could favor a bullish Solana price prediction and propel the token to a new all-time high. Just a day after its launch, the new Bitwise Solana Staking ETF (BSOL) has attracted nearly $300 million in assets, offering a 7.3% annual percentage yield (APY) to investors by staking 100% of the fund’s assets. Meanwhile, Western Union announced the launch of a Solana-based stablecoin, USDPT. This new stable asset will hit the market in the first half of 2026 and will work with “partner exchanges” to make the token available to users. “Our Digital Asset Network and USDPT will be an enabler in achieving our mission to make financial services accessible to people everywhere,” commented the head of Western Union, Devin McGranahan Solana Price Prediction: RSI Sends Buy Signal as Positive Momentum Accelerates In the past 7 days, SOL has booked a 7% gain while bulls seem to be doing their best to keep the token above $200 ahead of the Fed’s interest rate decision. It has bounced off a key support at $180 multiple times, favoring a bullish short-term outlook. This price area shows confluence between both horizontal and trend line supports and could serve as a launching pad to propel it to a new all-time high soon. Meanwhile, the Relative Strength Index (RSI) also sent a buy signal as it rose above the 14-day moving average, emphasizing that positive momentum is accelerating. As institutional adoption grows and Wall Street becomes enamored with this high-yielding Solana-linked product, billions could flow to the token in the next few weeks. Meanwhile, top crypto presales like SUBBD ($SUBBD) will also attract significant attention from investors during this cycle. This project could be a hidden gem in the Ethereum ecosystem as it prepares to launch its decentralized content distribution platform. SUBBD ($SUBBD) Brings AI and Web 3 Innovation to the Creator Economy SUBBD ($SUBBD) is building an all-in-one AI-powered content creation platform designed for the Web3 era. It helps creators streamline their workflow by allowing them to generate and edit videos with AI — all without leaving the platform. Unlike traditional creator platforms bogged down by high fees and restrictive algorithms, SUBBD gives users control over their content, audience, and revenue. The $SUBBD token is at the center of this thriving ecosystem, serving as a payment method for subscriptions, exclusive content purchases, and staking. What makes SUBBD stand out is its integrated AI Creator and AI Personal Assistant, allowing influencers to launch virtual influencer personas or automate content tasks seamlessly. Early $SUBBD buyers will reap the highest returns once the platform is officially launched. To buy $SUBBD before the next price increase, visit the official SUBBD website , and connect your favorite wallet (e.g. Best Wallet ). You can complete your purchase by either swapping ETH or USDT or by using a bank card. The post Solana Price Prediction: SOL is All The Rage Today As ETFs Launch and Western Union Announces Stablecoin Launch for Early 2026 – Is a New ATH Coming? appeared first on Cryptonews .",
      "KEYWORDS": "Price Analysis|Price Prediction|Solana|Solana ETF",
      "LANG": "EN",
      "UPVOTES": 0,
      "DOWNVOTES": 0,
      "SCORE": 0,
      "SENTIMENT": "POSITIVE",
      "STATUS": "ACTIVE",
      "CREATED_ON": 1761740700,
      "UPDATED_ON": 1761740700,
      "SOURCE_DATA": {
        "TYPE": "120",
        "ID": 52,
        "SOURCE_KEY": "cryptonews",
        "NAME": "cryptonews",
        "IMAGE_URL": "https://images.cryptocompare.com/news/default/cryptonews.png",
        "URL": "https://cryptonews.com/news/feed/",
        "LANG": "EN",
        "SOURCE_TYPE": "RSS",
        "LAUNCH_DATE": null,
        "SORT_ORDER": 0,
        "BENCHMARK_SCORE": 0,
        "STATUS": "ACTIVE",
        "LAST_UPDATED_TS": 1761738278,
        "CREATED_ON": 1657730129,
        "UPDATED_ON": 1680604053
      },
      "CATEGORY_DATA": [
        {
          "TYPE": "122",
          "ID": 15,
          "NAME": "BUSINESS",
          "CATEGORY": "BUSINESS"
        },
        {
          "TYPE": "122",
          "ID": 24,
          "NAME": "ETH",
          "CATEGORY": "ETH"
        },
        {
          "TYPE": "122",
          "ID": 46,
          "NAME": "SOL",
          "CATEGORY": "SOL"
        },
        {
          "TYPE": "122",
          "ID": 50,
          "NAME": "TRADING",
          "CATEGORY": "TRADING"
        },
        {
          "TYPE": "122",
          "ID": 211,
          "NAME": "CRYPTOCURRENCY",
          "CATEGORY": "CRYPTOCURRENCY"
        }
      ]
    },
    {
      "TYPE": "121",
      "ID": 53779863,
      "GUID": "https://cryptonews.com/?p=445049",
      "PUBLISHED_ON": 1761740505,
      "PUBLISHED_ON_NS": null,
      "IMAGE_URL": "https://resources.cryptocompare.com/news/52/53779863.jpeg",
      "TITLE": "Shiba Inu Price Prediction: SHIB Price Bottoms as Signer Keys Leak on Shibaswap, Is The OG Meme Coin About to Crash?",
      "SUBTITLE": null,
      "AUTHORS": "Anas Hassan",
      "URL": "https://cryptonews.com/news/shiba-inu-price-prediction-shib-price-bottoms-as-signer-keys-leak-on-shibaswap-is-the-og-meme-coin-about-to-crash/",
      "SOURCE_ID": 52,
      "BODY": "Discussions around the most recent Shiba Inu price prediction have been clouded with fear from SHIB holders following a Tikala Security alert that multiple signer keys appear to have leaked on Shibaswap, causing a $2.8 million loss today. On-chain data from Etherscan shows that the attacker withdrew Shiba tokens multiple times by providing legitimate Merkle leaf exit requests from a root signed by 10 different addresses. It seems like multiple signer keys appear to have leaked in Shibaswap, causing a $2.8M loss today @Shibtoken . The attacker ( https://t.co/B9pqiGqIvy ) withdrew multiple times by providing legit Merkle leaf exit requests from a root signed by 10 different addresses. The \"legit\"… — Tikkala Security (@TikkalaResearch) September 12, 2025 For context, a signer key is the private cryptographic key an account uses to sign transactions on a blockchain. Whoever has that private key can authorize actions from that account, move tokens, call smart-contract functions, mint and burn tokens if the contract grants those powers. Leaked Signer Keys on Shibaswap Drained $2.8M SHIB tokens This loophole is what the attacker capitalized on through the root hash to steal nearly $3 million in SHIB. Tikala Security’s auditing team found that the exit() call function in the root chain manager contract on Shibaswap, which verifies if any request is a legitimate leaf under that root hash, gave the attacker room to control and manipulate the root hash at will. Source: X/ TikkalaResearch Many SHIB holders are now fearful that the OG meme coin is about to crash. Looking at market data, Shiba Inu (SHIB) has been in a downtrend for most of 2025, currently down 45% on YTD performance, which has resulted in muted trading activity. At press time, SHIB maintains a $6 billion market cap but can only boast a $150 million trading volume, small compared to the likes of PEPE, which, with a $3 billion market cap, is still seeing about $400 million in trading volume. Shiba Inu price prediction: Analysts Eye Critical $0.0000119 Breakout However, market analysts believe SHIB is in its “calm before the storm” moment, as the price is quietly gathering strength in a major demand zone. $SHIB the calm before the explode. Shiba Inu momentum is at historic lows. The price is quietly gathering strength in a major demand zone. This silence could be the sound of accumulation. And every accumulation has its breakout. pic.twitter.com/tv8RMtlKex — EᴛʜᴇʀNᴀꜱʏᴏɴᴀL (@EtherNasyonaL) October 25, 2025 The signals point to a forthcoming bounce from the support zone that could launch the price toward targets at $0.00001170, $0.00001430, $0.00001600, and $0.00001850. On the technical front, the SHIB/USDT daily chart shows the token consolidating near a strong buy zone between $0.0000098 and $0.0000108, an area that has historically triggered multiple rebounds. Price recently tested this level again after a sharp drop, suggesting potential accumulation by buyers. A descending trendline continues to cap upside momentum, defining the short-term bearish structure. Source: TradingView For a reversal to gain traction, SHIB must break above the nearby resistance at $0.0000119, which aligns with the descending trendline. A confirmed breakout above that region could open the path toward the next major supply area near $0.0000176. Until that breakout occurs, SHIB remains range-bound, with price likely to oscillate between the strong buy zone and short-term resistance. Traders Flee to PepeNode With $2M Raised in 30 Days SHIB’s weaker price action has sent short-term traders searching for higher upside elsewhere. PEPENODE has emerged as a standout option with its mine-to-earn model designed for every type of investor. This new presale project has raised nearly $2 million in just over a month. With PEPENODE, users can create mining setups in a virtual environment by purchasing miner nodes, and top miners earn bonuses in popular meme coins like Pepe and SHIB. PEPENODE is currently priced at $0.0011138 per token, with prices rising every few days as tokens sell out rapidly. You can purchase the token directly through the official PEPENODE presale website using ETH, USDT, USDC, or bank cards. The post Shiba Inu Price Prediction: SHIB Price Bottoms as Signer Keys Leak on Shibaswap, Is The OG Meme Coin About to Crash? appeared first on Cryptonews .",
      "KEYWORDS": "Price Analysis|SHIB|Shiba inu",
      "LANG": "EN",
      "UPVOTES": 0,
      "DOWNVOTES": 0,
      "SCORE": 0,
      "SENTIMENT": "NEGATIVE",
      "STATUS": "ACTIVE",
      "CREATED_ON": 1761740556,
      "UPDATED_ON": 1761740556,
      "SOURCE_DATA": {
        "TYPE": "120",
        "ID": 52,
        "SOURCE_KEY": "cryptonews",
        "NAME": "cryptonews",
        "IMAGE_URL": "https://images.cryptocompare.com/news/default/cryptonews.png",
        "URL": "https://cryptonews.com/news/feed/",
        "LANG": "EN",
        "SOURCE_TYPE": "RSS",
        "LAUNCH_DATE": null,
        "SORT_ORDER": 0,
        "BENCHMARK_SCORE": 0,
        "STATUS": "ACTIVE",
        "LAST_UPDATED_TS": 1761738278,
        "CREATED_ON": 1657730129,
        "UPDATED_ON": 1680604053
      },
      "CATEGORY_DATA": [
        {
          "TYPE": "122",
          "ID": 13,
          "NAME": "BLOCKCHAIN",
          "CATEGORY": "BLOCKCHAIN"
        },
        {
          "TYPE": "122",
          "ID": 37,
          "NAME": "MARKET",
          "CATEGORY": "MARKET"
        },
        {
          "TYPE": "122",
          "ID": 44,
          "NAME": "SHIB",
          "CATEGORY": "SHIB"
        },
        {
          "TYPE": "122",
          "ID": 50,
          "NAME": "TRADING",
          "CATEGORY": "TRADING"
        },
        {
          "TYPE": "122",
          "ID": 211,
          "NAME": "CRYPTOCURRENCY",
          "CATEGORY": "CRYPTOCURRENCY"
        }
      ]
    },
    {
      "TYPE": "121",
      "ID": 53779937,
      "GUID": "https://cryptodaily.co.uk/2025/10/3-tokens-under-1-to-buy-now-and-hold-with-cardano-for-10x-gains-by-bitcoins-cycle-top-in-2026",
      "PUBLISHED_ON": 1761740309,
      "PUBLISHED_ON_NS": null,
      "IMAGE_URL": "https://resources.cryptocompare.com/news/75/53779937.jpeg",
      "TITLE": "3 Tokens Under $1 to Buy Now and Hold with Cardano for 10x Gains by Bitcoin’s Cycle Top in 2026",
      "SUBTITLE": null,
      "AUTHORS": "Maya Collins",
      "URL": "https://cryptodaily.co.uk/2025/10/3-tokens-under-1-to-buy-now-and-hold-with-cardano-for-10x-gains-by-bitcoins-cycle-top-in-2026",
      "SOURCE_ID": 75,
      "BODY": "With the crypto market gearing up for the next major cycle and Bitcoin (BTC) once again driving attention back toward altcoins, smart investors are scouting for hidden gems that trade under $1. These are tokens that combine utility, momentum, and upside potential while still being accessible. Among those standing out today are Little Pepe (LILPEPE) , SUI, and Jupiter (JUP), each of which offers a different flavour of opportunity and could slot alongside a core position like Cardano for a diversified portfolio aiming at 10× growth before the cycle peaks. Little Pepe (LILPEPE): The Meme Coin Whales Are Quietly Accumulating Let’s start with Little Pepe (LILPEPE), a token that’s turning into something of a phenomenon. It’s already CertiK-audited, listed on CoinMarketCap, and currently in stage 13 of its presale, priced at $0.0022. The project has raised over $27.2 million and sold more than 16.5 million tokens, demonstrating the powerful community momentum surrounding this meme driven gem. Whale wallets have reportedly been joining the presale, and for good reason. Meme coins have a history of delivering some of the biggest returns in the crypto space, but LILPEPE stands out for its structured roadmap and professional execution. This isn’t just a meme coin with funny branding, it’s a whole ecosystem being built around culture, speed, and investor security. Adding to the hype is the Little Pepe $777K Giveaway, where ten winners will each receive $77,000 worth of LILPEPE tokens. If LILPEPE follows its roadmap, even modest investments could turn into life changing profits. Whales seem to know it, and that’s why accumulation is ramping up.\\ SUI: A Rapid Recovery That Signals Strength The next big name on the list is SUI, a project that’s showing remarkable resilience. Not long ago, SUI dropped to around $0.55, leading some to believe it had lost its steam. But in true crypto fashion, it made a powerful comeback, now trading at $2.52. That kind of recovery doesn’t happen by accident, it’s a sign of strong investor confidence and deep liquidity support. Whale data confirms that large transactions have been steadily increasing on SUI, suggesting accumulation rather than distribution. That’s a bullish signal in any market, but especially now when confidence in the altcoin sector is returning. Analysts predict that if the broader market continues its rebound, SUI could be poised for 1,000% gains, particularly given its growing ecosystem and increasing developer interest. Jupiter (JUP): Quietly Building Pressure with Big Airdrops Jupiter (JUP) has been building one of the strongest user driven ecosystems on Solana. The key catalyst? Stakers are now eligible for massive upcoming airdrops, and that’s been driving demand through the roof. Whale movements suggest accumulation has been steady since the airdrop announcements. Airdrop incentives usually lead to heavy short-term buying pressure, but in Jupiter’s case, it’s turning into something more sustainable. Holders are locking in their tokens, reducing circulating supply and creating a perfect storm for potential price acceleration. Analysts are calling for 100% to 200% upside as Jupiter continues to cement itself as one of the core players in Solana’s DeFi infrastructure. If Solana’s momentum keeps up, JUP could easily become one of the network’s breakout assets. Conclusion If you believe that the next crypto cycle will favour both platforms and infrastructure and the cultural lightning of meme coins, then pairing Cardano with signals from Little Pepe (LILPEPE), SUI, and Jupiter (JUP) could be a strategic move. At current prices and with the roadmaps in play, these tokens under $1 represent accessible entry points with meaningful upside. If the market follows the script many long-term investors anticipate, this quartet could be part of a portfolio that not only retains value but also transforms it before the cycle ends. For more information about Little Pepe (LILPEPE) visit the links below: Website: https://littlepepe.com Whitepaper: https://littlepepe.com/whitepaper.pdf Telegram: https://t.me/littlepepetoken Twitter/X: https://x.com/littlepepetoken $777k Giveaway: https://littlepepe.com/777k-giveaway/ Disclaimer: This is a sponsored article and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.",
      "KEYWORDS": "More News",
      "LANG": "EN",
      "UPVOTES": 0,
      "DOWNVOTES": 0,
      "SCORE": 0,
      "SENTIMENT": "POSITIVE",
      "STATUS": "ACTIVE",
      "CREATED_ON": 1761740696,
      "UPDATED_ON": 1761740696,
      "SOURCE_DATA": {
        "TYPE": "120",
        "ID": 75,
        "SOURCE_KEY": "cryptodaily",
        "NAME": "Crypto Daily",
        "IMAGE_URL": "https://resources.cryptocompare.com/news/75/default.png",
        "URL": "https://cryptodaily.co.uk/feed",
        "LANG": "EN",
        "SOURCE_TYPE": "RSS",
        "LAUNCH_DATE": null,
        "SORT_ORDER": 0,
        "BENCHMARK_SCORE": 0,
        "STATUS": "ACTIVE",
        "LAST_UPDATED_TS": 1761738283,
        "CREATED_ON": 1685543991,
        "UPDATED_ON": 1685544026
      },
      "CATEGORY_DATA": [
        {
          "TYPE": "122",
          "ID": 3,
          "NAME": "ADA",
          "CATEGORY": "ADA"
        },
        {
          "TYPE": "122",
          "ID": 14,
          "NAME": "BTC",
          "CATEGORY": "BTC"
        },
        {
          "TYPE": "122",
          "ID": 96,
          "NAME": "SUI",
          "CATEGORY": "SUI"
        },
        {
          "TYPE": "122",
          "ID": 123,
          "NAME": "JUP",
          "CATEGORY": "JUP"
        },
        {
          "TYPE": "122",
          "ID": 211,
          "NAME": "CRYPTOCURRENCY",
          "CATEGORY": "CRYPTOCURRENCY"
        }
      ]
    },
    {
      "TYPE": "121",
      "ID": 53779746,
      "GUID": "https://en.coin-turk.com/?p=205530",
      "PUBLISHED_ON": 1761740303,
      "PUBLISHED_ON_NS": null,
      "IMAGE_URL": "https://resources.cryptocompare.com/news/79/53779746.jpeg",
      "TITLE": "Financial Watchdog Raises Concerns over Cryptocurrency Investment Risks",
      "SUBTITLE": null,
      "AUTHORS": "COINTURK NEWS",
      "URL": "https://en.coin-turk.com/financial-watchdog-raises-concerns-over-cryptocurrency-investment-risks/",
      "SOURCE_ID": 79,
      "BODY": "Financial bodies caution against cryptocurrency risks despite increasing interest in digital currencies. Current regulations exist but may not fully address emerging digital asset markets. Continue Reading: Financial Watchdog Raises Concerns over Cryptocurrency Investment Risks The post Financial Watchdog Raises Concerns over Cryptocurrency Investment Risks appeared first on COINTURK NEWS .",
      "KEYWORDS": "Cryptocurrency Law",
      "LANG": "EN",
      "UPVOTES": 0,
      "DOWNVOTES": 0,
      "SCORE": 0,
      "SENTIMENT": "NEGATIVE",
      "STATUS": "ACTIVE",
      "CREATED_ON": 1761740336,
      "UPDATED_ON": 1761740337,
      "SOURCE_DATA": {
        "TYPE": "120",
        "ID": 79,
        "SOURCE_KEY": "cointurken",
        "NAME": "CoinTurk News",
        "IMAGE_URL": "https://resources.cryptocompare.com/news/79/default.png",
        "URL": "https://en.coin-turk.com/feed/",
        "LANG": "EN",
        "SOURCE_TYPE": "RSS",
        "LAUNCH_DATE": null,
        "SORT_ORDER": 0,
        "BENCHMARK_SCORE": 0,
        "STATUS": "ACTIVE",
        "LAST_UPDATED_TS": 1761738279,
        "CREATED_ON": 1689939795,
        "UPDATED_ON": 1690273097
      },
      "CATEGORY_DATA": [
        {
          "TYPE": "122",
          "ID": 37,
          "NAME": "MARKET",
          "CATEGORY": "MARKET"
        },
        {
          "TYPE": "122",
          "ID": 211,
          "NAME": "CRYPTOCURRENCY",
          "CATEGORY": "CRYPTOCURRENCY"
        }
      ]
    },
    {
      "TYPE": "121",
      "ID": 53779698,
      "GUID": "https://cointelegraph.com/news/these-four-xrp-price-charts-predict-rally-toward-3-dollars?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "PUBLISHED_ON": 1761740042,
      "PUBLISHED_ON_NS": null,
      "IMAGE_URL": "https://images.cryptocompare.com/news/default/cointelegraph.png",
      "TITLE": "These four XRP price charts predict a rally toward $3",
      "SUBTITLE": null,
      "AUTHORS": "Cointelegraph by Nancy Lubale",
      "URL": "https://cointelegraph.com/news/these-four-xrp-price-charts-predict-rally-toward-3-dollars?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
      "SOURCE_ID": 16,
      "BODY": "Multiple technical indicators suggested a potential XRP price rally toward $3 in the coming days as the balance on exchanges hit five-year lows.",
      "KEYWORDS": "",
      "LANG": "EN",
      "UPVOTES": 0,
      "DOWNVOTES": 0,
      "SCORE": 0,
      "SENTIMENT": "POSITIVE",
      "STATUS": "ACTIVE",
      "CREATED_ON": 1761740232,
      "UPDATED_ON": null,
      "SOURCE_DATA": {
        "TYPE": "120",
        "ID": 16,
        "SOURCE_KEY": "cointelegraph",
        "NAME": "Cointelegraph",
        "IMAGE_URL": "https://images.cryptocompare.com/news/default/cointelegraph.png",
        "URL": "https://cointelegraph.com/rss",
        "LANG": "EN",
        "SOURCE_TYPE": "RSS",
        "LAUNCH_DATE": 1382054400,
        "SORT_ORDER": 0,
        "BENCHMARK_SCORE": 0,
        "STATUS": "ACTIVE",
        "LAST_UPDATED_TS": 1761738178,
        "CREATED_ON": 1657730129,
        "UPDATED_ON": 1760450177
      },
      "CATEGORY_DATA": [
        {
          "TYPE": "122",
          "ID": 50,
          "NAME": "TRADING",
          "CATEGORY": "TRADING"
        },
        {
          "TYPE": "122",
          "ID": 58,
          "NAME": "XRP",
          "CATEGORY": "XRP"
        },
        {
          "TYPE": "122",
          "ID": 211,
          "NAME": "CRYPTOCURRENCY",
          "CATEGORY": "CRYPTOCURRENCY"
        }
      ]
    },
    {
      "TYPE": "121",
      "ID": 53779500,
      "GUID": "https://ambcrypto.com/?p=541264",
      "PUBLISHED_ON": 1761739827,
      "PUBLISHED_ON_NS": null,
      "IMAGE_URL": "https://images.cryptocompare.com/news/default/ambcrypto.png",
      "TITLE": "How do crypto casinos hold up against real money offerings on Casino.ca in Canada?",
      "SUBTITLE": null,
      "AUTHORS": "AMBCrypto Team",
      "URL": "https://ambcrypto.com/how-do-crypto-casinos-hold-up-against-real-money-offerings-on-casino-ca-in-canada/",
      "SOURCE_ID": 32,
      "BODY": "The online gambling world in Canada is evolving faster than ever. Traditional online casinos that",
      "KEYWORDS": "Google News|HideCryptopanic|Press Release",
      "LANG": "EN",
      "UPVOTES": 0,
      "DOWNVOTES": 0,
      "SCORE": 0,
      "SENTIMENT": "NEUTRAL",
      "STATUS": "ACTIVE",
      "CREATED_ON": 1761739890,
      "UPDATED_ON": null,
      "SOURCE_DATA": {
        "TYPE": "120",
        "ID": 32,
        "SOURCE_KEY": "ambcrypto",
        "NAME": "AMB Crypto",
        "IMAGE_URL": "https://images.cryptocompare.com/news/default/ambcrypto.png",
        "URL": "https://ambcrypto.com/feed/",
        "LANG": "EN",
        "SOURCE_TYPE": "RSS",
        "LAUNCH_DATE": null,
        "SORT_ORDER": 0,
        "BENCHMARK_SCORE": 0,
        "STATUS": "ACTIVE",
        "LAST_UPDATED_TS": 1761738285,
        "CREATED_ON": 1657730129,
        "UPDATED_ON": 1674467937
      },
      "CATEGORY_DATA": [
        {
          "TYPE": "122",
          "ID": 211,
          "NAME": "CRYPTOCURRENCY",
          "CATEGORY": "CRYPTOCURRENCY"
        }
      ]
    },
    {
      "TYPE": "121",
      "ID": 53779516,
      "GUID": "https://bitcoinworld.co.in/?p=213112",
      "PUBLISHED_ON": 1761739810,
      "PUBLISHED_ON_NS": null,
      "IMAGE_URL": "https://resources.cryptocompare.com/news/82/53779516.jpeg",
      "TITLE": "Yala Hacker Apprehended: Most Stolen Funds Recovered in Swift Police Action",
      "SUBTITLE": null,
      "AUTHORS": "Editorial Team",
      "URL": "https://bitcoinworld.co.in/yala-hacker-funds-recovered/",
      "SOURCE_ID": 82,
      "BODY": "BitcoinWorld Yala Hacker Apprehended: Most Stolen Funds Recovered in Swift Police Action The cryptocurrency world often grapples with the fallout from hacks and exploits, but today brings a refreshing wave of positive news. The Yala hacker , responsible for a significant multi-million dollar theft, has been successfully apprehended by police in Bangkok. This remarkable development not only brings justice closer but also confirms the recovery of most of the stolen funds from Yala, a prominent Bitcoin-native liquidity protocol. It’s a pivotal moment, signaling a growing capacity for law enforcement to tackle digital asset crime and offering a renewed sense of security to the crypto community. What Exactly Happened to the Yala Protocol? Yala, a protocol designed to enhance Bitcoin’s utility by providing liquidity, became the target of a sophisticated cyberattack last month. The exploit resulted in a substantial loss, estimated at approximately $7.64 million in digital assets. Such incidents can be devastating, causing immediate financial distress for users and casting a shadow of doubt over the security of decentralized finance (DeFi) platforms. The aftermath of a hack often involves a frantic scramble by the protocol team to understand the breach, secure remaining assets, and communicate with their community. The Target: Yala, a Bitcoin-native liquidity protocol, vital for enabling more flexible use of BTC. The Damage: Roughly $7.64 million in funds were siphoned off through a complex exploit. The Aftermath: Uncertainty and concern for users, alongside an urgent need for action from the Yala team. How Was the Yala Hacker Tracked Down and Arrested? The arrest of the Yala hacker is a significant testament to the evolving capabilities of law enforcement in the digital age. Following the hack, the Yala team quickly engaged with authorities, providing crucial information that aided the investigation. Police in Bangkok, leveraging their expertise in cybercrime, meticulously traced the digital footprints left by the perpetrator. This collaborative effort between the protocol and law enforcement proved instrumental in identifying and apprehending the individual. What makes this case particularly noteworthy is the successful recovery of a substantial portion of the stolen assets. In many crypto hacks, funds are quickly laundered and dispersed, making recovery incredibly difficult, if not impossible. The fact that most of the funds were retrieved sends a powerful message: the anonymity once afforded by blockchain is not absolute, and dedicated investigative work can yield tangible results. This success offers a rare but vital example of justice being served in the often-turbulent world of crypto security. What Does This Arrest Mean for Crypto Security and User Trust? The apprehension of the Yala hacker has far-reaching implications for the entire cryptocurrency ecosystem. For too long, the perception has been that crypto criminals operate with impunity, shielded by decentralization. This incident challenges that notion, demonstrating that determined law enforcement can penetrate these layers. It serves as a potent deterrent, reminding would-be attackers that their actions have consequences, even in the digital realm. Furthermore, this successful recovery effort is a crucial step in rebuilding and strengthening user trust. When protocols are hacked, confidence can plummet, hindering adoption and innovation. Seeing a positive resolution, where funds are recovered and justice is pursued, reassures users that their assets are not entirely without recourse. It highlights the growing maturity of the crypto industry, where security measures and legal frameworks are slowly catching up to technological advancements. Key positive impacts for the crypto community: Stronger Deterrence: Criminals may think twice before targeting crypto protocols. Increased Confidence: Users gain more trust in the security and legal recourse available in the crypto space. Enhanced Cooperation: A clear example of successful collaboration between private crypto entities and public law enforcement. Precedent for Recovery: Offers hope that fund recovery is possible, even for large-scale exploits. Moving Forward: Lessons Learned from the Yala Hacker Incident While celebrating this victory, it’s essential to acknowledge that the threat of cyberattacks remains constant. The Yala hack, despite its positive resolution, underscores the critical importance of continuous vigilance and robust security practices. Protocols must prioritize regular, independent security audits, implement multi-factor authentication, and develop comprehensive incident response plans. For users, the message is clear: always practice due diligence, use strong, unique passwords, and be wary of phishing attempts. The story of the Yala hacker ‘s arrest is more than just a news item; it’s a powerful narrative about the evolving landscape of digital asset security. It showcases that while challenges persist, the combined efforts of innovative protocols and dedicated law enforcement can lead to remarkable outcomes. As the cryptocurrency industry continues its rapid growth, such instances of justice and recovery will be vital in fostering a safer, more trustworthy environment for all participants. To learn more about the latest crypto market trends, explore our article on key developments shaping Bitcoin institutional adoption. Frequently Asked Questions (FAQs) Q1: What is the Yala protocol? A1: Yala is a Bitcoin-native liquidity protocol designed to enhance the utility and accessibility of Bitcoin by enabling users to engage with their assets in various decentralized finance (DeFi) applications. Q2: How much money was stolen in the Yala hack? A2: Approximately $7.64 million in digital assets were stolen during the Yala protocol hack last month. Q3: Have all the stolen funds been recovered? A3: While not all, most of the stolen funds have been successfully recovered following the arrest of the Yala hacker by Bangkok police. This is a significant achievement in crypto crime recovery. Q4: Why is this arrest significant for the crypto community? A4: The arrest of the Yala hacker and the recovery of funds are significant because they demonstrate that law enforcement agencies are becoming more capable of tracking and prosecuting cybercriminals in the crypto space. This helps deter future attacks and builds trust in the security of digital assets. Q5: What lessons can be learned from the Yala hack? A5: The incident highlights the ongoing importance of robust security audits, strong internal security measures for protocols, and the critical role of collaboration between crypto projects and law enforcement. For users, it reinforces the need for vigilance and good personal security practices. Did you find this news about the Yala hacker ‘s arrest and fund recovery encouraging? Share this article with your network on social media to spread the word about this positive development in crypto security! This post Yala Hacker Apprehended: Most Stolen Funds Recovered in Swift Police Action first appeared on BitcoinWorld .",
      "KEYWORDS": "Crypto News|Bangkok police|Blockchain Hack|crypto security|fund recovery|Yala protocol",
      "LANG": "EN",
      "UPVOTES": 0,
      "DOWNVOTES": 0,
      "SCORE": 0,
      "SENTIMENT": "POSITIVE",
      "STATUS": "ACTIVE",
      "CREATED_ON": 1761739911,
      "UPDATED_ON": 1761739912,
      "SOURCE_DATA": {
        "TYPE": "120",
        "ID": 82,
        "SOURCE_KEY": "bitcoinworld",
        "NAME": "Bitcoin World",
        "IMAGE_URL": "https://resources.cryptocompare.com/news/82/default.png",
        "URL": "https://bitcoinworld.co.in/feed/",
        "LANG": "EN",
        "SOURCE_TYPE": "RSS",
        "LAUNCH_DATE": null,
        "SORT_ORDER": 0,
        "BENCHMARK_SCORE": 0,
        "STATUS": "ACTIVE",
        "LAST_UPDATED_TS": 1761738174,
        "CREATED_ON": 1698066984,
        "UPDATED_ON": 1747932437
      },
      "CATEGORY_DATA": [
        {
          "TYPE": "122",
          "ID": 13,
          "NAME": "BLOCKCHAIN",
          "CATEGORY": "BLOCKCHAIN"
        },
        {
          "TYPE": "122",
          "ID": 14,
          "NAME": "BTC",
          "CATEGORY": "BTC"
        },
        {
          "TYPE": "122",
          "ID": 37,
          "NAME": "MARKET",
          "CATEGORY": "MARKET"
        },
        {
          "TYPE": "122",
          "ID": 41,
          "NAME": "REGULATION",
          "CATEGORY": "REGULATION"
        },
        {
          "TYPE": "122",
          "ID": 211,
          "NAME": "CRYPTOCURRENCY",
          "CATEGORY": "CRYPTOCURRENCY"
        }
      ]
    },
    {
      "TYPE": "121",
      "ID": 53779601,
      "GUID": "df16b794-d689-4948-822b-947dd4ba043d",
      "PUBLISHED_ON": 1761739727,
      "PUBLISHED_ON_NS": null,
      "IMAGE_URL": "https://resources.cryptocompare.com/news/5/53779601.jpeg",
      "TITLE": "Australian Regulator Signals Broader Digital Asset Oversight Ahead of New Licensing Regime",
      "SUBTITLE": "ASIC said many digital assets are covered by existing financial laws as it readies the ground for impending digital asset platform legislation.",
      "AUTHORS": "Jamie Crawley,AI Boost",
      "URL": "https://www.coindesk.com/policy/2025/10/29/australian-regulator-signals-broader-digital-asset-oversight-ahead-of-new-licensing-regime",
      "SOURCE_ID": 5,
      "BODY": "ASIC said many digital assets are covered by existing financial laws as it readies the ground for impending digital asset platform legislation.",
      "KEYWORDS": "Policy|Australia|ASIC|Regulation|News",
      "LANG": "EN",
      "UPVOTES": 0,
      "DOWNVOTES": 0,
      "SCORE": 0,
      "SENTIMENT": "NEUTRAL",
      "STATUS": "ACTIVE",
      "CREATED_ON": 1761740097,
      "UPDATED_ON": 1761740097,
      "SOURCE_DATA": {
        "TYPE": "120",
        "ID": 5,
        "SOURCE_KEY": "coindesk",
        "NAME": "CoinDesk",
        "IMAGE_URL": "https://resources.cryptocompare.com/news/5/default.png",
        "URL": "https://www.coindesk.com/arc/outboundfeeds/rss/?outputType=xml",
        "LANG": "EN",
        "SOURCE_TYPE": "RSS",
        "LAUNCH_DATE": 1367884800,
        "SORT_ORDER": 0,
        "BENCHMARK_SCORE": 71,
        "STATUS": "ACTIVE",
        "LAST_UPDATED_TS": 1761738257,
        "CREATED_ON": 1657730129,
        "UPDATED_ON": 1744296800
      },
      "CATEGORY_DATA": [
        {
          "TYPE": "122",
          "ID": 41,
          "NAME": "REGULATION",
          "CATEGORY": "REGULATION"
        },
        {
          "TYPE": "122",
          "ID": 211,
          "NAME": "CRYPTOCURRENCY",
          "CATEGORY": "CRYPTOCURRENCY"
        }
      ]
    }
  ],
  "Err": {}
}